RT-Thread/rt-thread/bsp/stm32f107/stm32_eth.c
  return bitstatus;
}

/**
  * @brief  Get the specified ETHERNET MMC register value.
  * @param ETH_MMCReg: specifies the ETHERNET MMC register.
  *   This parameter can be one of the following values:
  * @arg ETH_MMCCR      : MMC CR register
  * @arg ETH_MMCRIR     : MMC RIR register
  * @arg ETH_MMCTIR     : MMC TIR register
  * @arg ETH_MMCRIMR    : MMC RIMR register
  * @arg ETH_MMCTIMR    : MMC TIMR register
  * @arg ETH_MMCTGFSCCR : MMC TGFSCCR register
  * @arg ETH_MMCTGFMSCCR: MMC TGFMSCCR register
  * @arg ETH_MMCTGFCR   : MMC TGFCR register
  * @arg ETH_MMCRFCECR  : MMC RFCECR register
  * @arg ETH_MMCRFAECR  : MMC RFAECR register
  * @arg ETH_MMCRGUFCR  : MMC RGUFCRregister
  * @retval : The value of ETHERNET MMC Register value.
  */
uint32_t ETH_GetMMCRegister(uint32_t ETH_MMCReg)
{
  /* Check the parameters */
  assert_param(IS_ETH_MMC_REGISTER(ETH_MMCReg));

  /* Return the selected register value */
  return (*(__IO uint32_t *)(ETH_MAC_BASE + ETH_MMCReg));
}
/*---------------------------------  PTP  ------------------------------------*/

/**
  * @brief  Updated the PTP block for fine correction with the Time Stamp
  *   Addend register value.
  * @param  None
  * @retval : None
  */
void ETH_EnablePTPTimeStampAddend(void)
{
  /* Enable the PTP block update with the Time Stamp Addend register value */
  ETH->PTPTSCR |= ETH_PTPTSCR_TSARU;
}

/**
  * @brief  Enable the PTP Time Stamp interrupt trigger
  * @param  None
  * @retval : None
  */
void ETH_EnablePTPTimeStampInterruptTrigger(void)
{
  /* Enable the PTP target time interrupt */
  ETH->PTPTSCR |= ETH_PTPTSCR_TSITE;
}

/**
  * @brief  Updated the PTP system time with the Time Stamp Update register
  *   value.
  * @param  None
  * @retval : None
  */
void ETH_EnablePTPTimeStampUpdate(void)
{
  /* Enable the PTP system time update with the Time Stamp Update register value */
  ETH->PTPTSCR |= ETH_PTPTSCR_TSSTU;
}

/**
  * @brief  Initialize the PTP Time Stamp
  * @param  None
  * @retval : None
  */
void ETH_InitializePTPTimeStamp(void)
{
  /* Initialize the PTP Time Stamp */
  ETH->PTPTSCR |= ETH_PTPTSCR_TSSTI;
}

/**
  * @brief  Selects the PTP Update method
  * @param UpdateMethod: the PTP Update method
  *   This parameter can be one of the following values:
  * @arg ETH_PTP_FineUpdate   : Fine Update method
  * @arg ETH_PTP_CoarseUpdate : Coarse Update method
  * @retval : None
  */
void ETH_PTPUpdateMethodConfig(uint32_t UpdateMethod)
{
  /* Check the parameters */
  assert_param(IS_ETH_PTP_UPDATE(UpdateMethod));

  if (UpdateMethod != ETH_PTP_CoarseUpdate)
  {
    /* Enable the PTP Fine Update method */
    ETH->PTPTSCR |= ETH_PTPTSCR_TSFCU;
  }
  else
  {
    /* Disable the PTP Coarse Update method */
    ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSCR_TSFCU);
  }
}

/**
  * @brief  Enables or disables the PTP time stamp for transmit and receive frames.
  * @param NewState: new state of the PTP time stamp for transmit and receive frames
  *   This parameter can be: ENABLE or DISABLE.
  * @retval : None
  */
void ETH_PTPTimeStampCmd(FunctionalState NewState)
{
  /* Check the parameters */
  assert_param(IS_FUNCTIONAL_STATE(NewState));

  if (NewState != DISABLE)
  {
    /* Enable the PTP time stamp for transmit and receive frames */
    ETH->PTPTSCR |= ETH_PTPTSCR_TSE;
  }
  else
  {
    /* Disable the PTP time stamp for transmit and receive frames */
    ETH->PTPTSCR &= (~(uint32_t)ETH_PTPTSCR_TSE);
  }
}

/**
  * @brief  Checks whether the specified ETHERNET PTP flag is set or not.
  * @param ETH_PTP_FLAG: specifies the flag to check.
  *   This parameter can be one of the following values:
  * @arg ETH_PTP_FLAG_TSARU : Addend Register Update
  * @arg ETH_PTP_FLAG_TSITE : Time Stamp Interrupt Trigger Enable
  * @arg ETH_PTP_FLAG_TSSTU : Time Stamp Update
  * @arg ETH_PTP_FLAG_TSSTI  : Time Stamp Initialize
  * @retval : The new state of ETHERNET PTP Flag (SET or RESET).
  */
FlagStatus ETH_GetPTPFlagStatus(uint32_t ETH_PTP_FLAG)
{
  FlagStatus bitstatus = RESET;
  /* Check the parameters */
  assert_param(IS_ETH_PTP_GET_FLAG(ETH_PTP_FLAG));

  if ((ETH->PTPTSCR & ETH_PTP_FLAG) != (uint32_t)RESET)
  {
    bitstatus = SET;
  }
  else
  {
    bitstatus = RESET;
  }
  return bitstatus;
}

/**
  * @brief  Sets the system time Sub-Second Increment value.
  * @param SubSecondValue: specifies the PTP Sub-Second Increment Register value.
  * @retval : None
  */
void ETH_SetPTPSubSecondIncrement(uint32_t SubSecondValue)
{
  /* Check the parameters */
  assert_param(IS_ETH_PTP_SUBSECOND_INCREMENT(SubSecondValue));
  /* Set the PTP Sub-Second Increment Register */
  ETH->PTPSSIR = SubSecondValue;
}

/**
  * @brief  Sets the Time Stamp update sign and values.
  * @param Sign: specifies the PTP Time update value sign.
  *   This parameter can be one of the following values:
  * @arg ETH_PTP_PositiveTime : positive time value.
  * @arg ETH_PTP_NegativeTime : negative time value.
  * @param SecondValue: specifies the PTP Time update second value.
  * @param SubSecondValue: specifies the PTP Time update sub-second value.
  *   this is a 31 bit value. bit32 correspond to the sign.
  * @retval : None
  */
void ETH_SetPTPTimeStampUpdate(uint32_t Sign, uint32_t SecondValue, uint32_t SubSecondValue)
{
  /* Check the parameters */
  assert_param(IS_ETH_PTP_TIME_SIGN(Sign));
  assert_param(IS_ETH_PTP_TIME_STAMP_UPDATE_SUBSECOND(SubSecondValue));
  /* Set the PTP Time Update High Register */
  ETH->PTPTSHUR = SecondValue;

  /* Set the PTP Time Update Low Register with sign */
  ETH->PTPTSLUR = Sign | SubSecondValue;
}

/**
  * @brief  Sets the Time Stamp Addend value.
  * @param Value: specifies the PTP Time Stamp Addend Register value.
  * @retval : None
  */
void ETH_SetPTPTimeStampAddend(uint32_t Value)
{
  /* Set the PTP Time Stamp Addend Register */
  ETH->PTPTSAR = Value;
}

/**
  * @brief  Sets the Target Time registers values.
  * @param HighValue: specifies the PTP Target Time High Register value.
  * @param LowValue: specifies the PTP Target Time Low Register value.
  * @retval : None
  */
void ETH_SetPTPTargetTime(uint32_t HighValue, uint32_t LowValue)
{
  /* Set the PTP Target Time High Register */
  ETH->PTPTTHR = HighValue;
  /* Set the PTP Target Time Low Register */
  ETH->PTPTTLR = LowValue;
}

/**
  * @brief  Get the specified ETHERNET PTP register value.
  * @param ETH_PTPReg: specifies the ETHERNET PTP register.
  *   This parameter can be one of the following values:
  * @arg ETH_PTPTSCR  : Sub-Second Increment Register
  * @arg ETH_PTPSSIR  : Sub-Second Increment Register
  * @arg ETH_PTPTSHR  : Time Stamp High Register
  * @arg ETH_PTPTSLR  : Time Stamp Low Register
  * @arg ETH_PTPTSHUR : Time Stamp High Update Register
  * @arg ETH_PTPTSLUR : Time Stamp Low Update Register
  * @arg ETH_PTPTSAR  : Time Stamp Addend Register
  * @arg ETH_PTPTTHR  : Target Time High Register
  * @arg ETH_PTPTTLR  : Target Time Low Register
  * @retval : The value of ETHERNET PTP Register value.
  */
uint32_t ETH_GetPTPRegister(uint32_t ETH_PTPReg)
{
  /* Check the parameters */
  assert_param(IS_ETH_PTP_REGISTER(ETH_PTPReg));

  /* Return the selected register value */
  return (*(__IO uint32_t *)(ETH_MAC_BASE + ETH_PTPReg));
}

/**
  * @brief  Initializes the DMA Tx descriptors in chain mode with PTP.
  * @param DMATxDescTab: Pointer on the first Tx desc list
  * @param DMAPTPTxDescTab: Pointer on the first PTP Tx desc list
  * @param TxBuff: Pointer on the first TxBuffer list
  * @param TxBuffCount: Number of the used Tx desc in the list
  * @retval : None
  */
void ETH_DMAPTPTxDescChainInit(ETH_DMADESCTypeDef *DMATxDescTab, ETH_DMADESCTypeDef *DMAPTPTxDescTab, uint8_t* TxBuff, uint32_t TxBuffCount)
{
  uint32_t i = 0;
  ETH_DMADESCTypeDef *DMATxDesc;

  /* Set the DMATxDescToSet pointer with the first one of the DMATxDescTab list */
  DMATxDescToSet = DMATxDescTab;
  DMAPTPTxDescToSet = DMAPTPTxDescTab;
  /* Fill each DMATxDesc descriptor with the right values */
  for(i=0; i < TxBuffCount; i++)
  {
    /* Get the pointer on the ith member of the Tx Desc list */
    DMATxDesc = DMATxDescTab+i;
    /* Set Second Address Chained bit and enable PTP */
    DMATxDesc->Status = ETH_DMATxDesc_TCH | ETH_DMATxDesc_TTSE;

