RT-Thread/rt-thread/bsp/stm32f107/stm32_eth.c
#define MII_MODE          /* MII mode for STM3210C-EVAL Board (MB784) (check jumpers setting) */

#define DP83848_PHY        	/* Ethernet pins mapped on STM3210C-EVAL Board */
#define PHY_ADDRESS       	0x01 /* Relative to STM3210C-EVAL Board */

#define ETH_RXBUFNB        	4
#define ETH_TXBUFNB        	2
static ETH_InitTypeDef ETH_InitStructure;
static ETH_DMADESCTypeDef  DMARxDscrTab[ETH_RXBUFNB], DMATxDscrTab[ETH_TXBUFNB];
static rt_uint8_t Rx_Buff[ETH_RXBUFNB][ETH_MAX_PACKET_SIZE], Tx_Buff[ETH_TXBUFNB][ETH_MAX_PACKET_SIZE];

#define MAX_ADDR_LEN 6
struct rt_stm32_eth
{
	/* inherit from ethernet device */
	struct eth_device parent;

	/* interface address info. */
	rt_uint8_t  dev_addr[MAX_ADDR_LEN];			/* hw address	*/
};
static struct rt_stm32_eth stm32_eth_device;
static struct rt_semaphore tx_wait;
static rt_bool_t tx_is_waiting = RT_FALSE;

/* interrupt service routine for ETH */
void ETH_IRQHandler(void)
{
	rt_uint32_t status;

    /* enter interrupt */
    rt_interrupt_enter();

	if (ETH_GetDMAITStatus(ETH_DMA_IT_R) == SET) /* packet receiption */
	{
		/* a frame has been received */
		eth_device_ready(&(stm32_eth_device.parent));

		ETH_DMAClearITPendingBit(ETH_DMA_IT_R);
	}

	if (ETH_GetDMAITStatus(ETH_DMA_IT_T) == SET) /* packet transmission */
	{
		if (tx_is_waiting == RT_TRUE)
		{
			tx_is_waiting = RT_FALSE;
			rt_sem_release(&tx_wait);
		}

		ETH_DMAClearITPendingBit(ETH_DMA_IT_T);
	}

	status = ETH->DMASR;

	/* Clear received IT */
	if ((status & ETH_DMA_IT_NIS) != (u32)RESET)
		ETH->DMASR = (u32)ETH_DMA_IT_NIS;
	if ((status & ETH_DMA_IT_AIS) != (u32)RESET)
		ETH->DMASR = (u32)ETH_DMA_IT_AIS;
	if ((status & ETH_DMA_IT_RO) != (u32)RESET)
		ETH->DMASR = (u32)ETH_DMA_IT_RO;

	if ((status & ETH_DMA_IT_RBU) != (u32)RESET)
	{
		ETH_ResumeDMAReception();
		ETH->DMASR = (u32)ETH_DMA_IT_RBU;
	}

	if ((status & ETH_DMA_IT_TBU) != (u32)RESET)
	{
		ETH_ResumeDMATransmission();
		ETH->DMASR = (u32)ETH_DMA_IT_TBU;
	} 

    /* leave interrupt */
    rt_interrupt_leave();
}

#define MICR 	0x11
#define MISR	0x12

void EXTI9_5_IRQHandler(void)
{
	volatile rt_uint16_t status;

	/* enter interrupt */
	rt_interrupt_enter();

	status = ETH_ReadPHYRegister(PHY_ADDRESS, MISR);
	if (status & (1 << 13))
	{
		/* change of link */
		status = ETH_ReadPHYRegister(PHY_ADDRESS, PHY_SR);
		if (status & 0x01) /* link established */
		{
			netif_set_link_up(stm32_eth_device.parent.netif);
		}
		else
		{
			netif_set_link_down(stm32_eth_device.parent.netif);
		}
	}

	/* Clear the Key Button EXTI line pending bit */
	EXTI_ClearITPendingBit(EXTI_Line5);
	
	/* leave interrupt */
	rt_interrupt_leave();
}

void rt_eth_phy_init(void)
{
	GPIO_InitTypeDef GPIO_InitStructure;
    EXTI_InitTypeDef EXTI_InitStructure;
    NVIC_InitTypeDef NVIC_InitStructure;

	/* Configure PC5 as input for PHY interrupt */
	GPIO_InitStructure.GPIO_Pin = GPIO_Pin_5;
	GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
	GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IPU;
	GPIO_Init(GPIOC, &GPIO_InitStructure);

    /* Connect PHY Interrupt Line to GPIOC Pin 5 */
    GPIO_EXTILineConfig(GPIO_PortSourceGPIOC, GPIO_PinSource5);

    /* Configure PHY Interrupt Line to generate an interrupt on falling edge */
    EXTI_InitStructure.EXTI_Line = EXTI_Line5;
    EXTI_InitStructure.EXTI_Mode = EXTI_Mode_Interrupt;
    EXTI_InitStructure.EXTI_Trigger = EXTI_Trigger_Falling;
    EXTI_InitStructure.EXTI_LineCmd = ENABLE;
    EXTI_Init(&EXTI_InitStructure);

	/* set PHY interrupt */
	ETH_WritePHYRegister(PHY_ADDRESS, MICR, 0x0003);
	ETH_WritePHYRegister(PHY_ADDRESS, MISR, 0x0060);

    /* Clear PHY Interrupt Line pending bit */
    EXTI_ClearITPendingBit(EXTI_Line5);


    /* Enable the EXTI0 Interrupt */
    NVIC_InitStructure.NVIC_IRQChannel = EXTI9_5_IRQn;
    NVIC_InitStructure.NVIC_IRQChannelPreemptionPriority = 1;
    NVIC_InitStructure.NVIC_IRQChannelSubPriority = 0;
    NVIC_InitStructure.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStructure);

}

/* RT-Thread Device Interface */
/* initialize the interface */
static rt_err_t rt_stm32_eth_init(rt_device_t dev)
{
	vu32 Value = 0;

	/* Reset ETHERNET on AHB Bus */
	ETH_DeInit();

	/* Software reset */
	ETH_SoftwareReset();

	/* Wait for software reset */
	while(ETH_GetSoftwareResetStatus()==SET);

	/* ETHERNET Configuration ------------------------------------------------------*/
	/* Call ETH_StructInit if you don't like to configure all ETH_InitStructure parameter */
	ETH_StructInit(&ETH_InitStructure);

	/* Fill ETH_InitStructure parametrs */
	/*------------------------   MAC   -----------------------------------*/
	ETH_InitStructure.ETH_AutoNegotiation = ETH_AutoNegotiation_Enable  ;
	ETH_InitStructure.ETH_Speed = ETH_Speed_100M;
	ETH_InitStructure.ETH_LoopbackMode = ETH_LoopbackMode_Disable;
	ETH_InitStructure.ETH_Mode = ETH_Mode_FullDuplex;
	ETH_InitStructure.ETH_RetryTransmission = ETH_RetryTransmission_Disable;
	ETH_InitStructure.ETH_AutomaticPadCRCStrip = ETH_AutomaticPadCRCStrip_Disable;
	ETH_InitStructure.ETH_ReceiveAll = ETH_ReceiveAll_Enable;
	ETH_InitStructure.ETH_BroadcastFramesReception = ETH_BroadcastFramesReception_Disable;
	ETH_InitStructure.ETH_PromiscuousMode = ETH_PromiscuousMode_Disable;
	ETH_InitStructure.ETH_MulticastFramesFilter = ETH_MulticastFramesFilter_Perfect;
	ETH_InitStructure.ETH_UnicastFramesFilter = ETH_UnicastFramesFilter_Perfect;

	/* Configure ETHERNET */
	Value = ETH_Init(&ETH_InitStructure, PHY_ADDRESS);

	/* Enable DMA Receive interrupt (need to enable in this case Normal interrupt) */
	ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R, ENABLE);
	
	/* Initialize Tx Descriptors list: Chain Mode */
	ETH_DMATxDescChainInit(DMATxDscrTab, &Tx_Buff[0][0], ETH_TXBUFNB);
	/* Initialize Rx Descriptors list: Chain Mode  */
	ETH_DMARxDescChainInit(DMARxDscrTab, &Rx_Buff[0][0], ETH_RXBUFNB);

	/* MAC address configuration */
	ETH_MACAddressConfig(ETH_MAC_Address0, (u8*)&stm32_eth_device.dev_addr[0]);

	/* Initialize PHY */
	rt_eth_phy_init();
	
	/* Enable MAC and DMA transmission and reception */
	ETH_Start();

